import libraries(I provide all libs that I need when make this tasks, if you need some external import them here)

In [2]:
import findspark
findspark.init()

In [3]:
import pyspark
import pyspark.sql.functions as F
from pyspark.sql import SparkSession
from pyspark.sql.types import StructType, StructField, IntegerType, StringType
from pyspark.sql.functions import col
from pyspark.sql.functions import max, avg, min
from pyspark.sql.window import Window
from pyspark.sql.functions import row_number
from pyspark.sql.functions import when

create local SparkSession

In [4]:
from pyspark.sql import SparkSession

spark = SparkSession \
    .builder \
    .appName("My PySpark") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

read csv with inferschema

In [5]:
df = spark.read.csv("ds_salaries.csv", header=True, inferSchema=True)

read csv one more time with the same code and you will see that it almostly don't take time, because info already in SparkSession and it will not read nothing
from this file

In [6]:
df.show()

+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
|_c0|work_year|experience_level|employment_type|           job_title|  salary|salary_currency|salary_in_usd|employee_residence|remote_ratio|company_location|company_size|
+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
|  0|     2020|              MI|             FT|      Data Scientist|   70000|            EUR|        79833|                DE|           0|              DE|           L|
|  1|     2020|              SE|             FT|Machine Learning ...|  260000|            USD|       260000|                JP|           0|              JP|           S|
|  2|     2020|              SE|             FT|   Big Data Engineer|   85000|            GBP|       109024|                GB|          50|              GB|           M|
|  3|     2020|              MI|             FT|Product Data Analyst|   20000|            USD|        20000|                HN|           0|              HN|           S|
|  4|     2020|              SE|             FT|Machine Learning ...|  150000|            USD|       150000|                US|          50|              US|           L|
|  5|     2020|              EN|             FT|        Data Analyst|   72000|            USD|        72000|                US|         100|              US|           L|
|  6|     2020|              SE|             FT| Lead Data Scientist|  190000|            USD|       190000|                US|         100|              US|           S|
|  7|     2020|              MI|             FT|      Data Scientist|11000000|            HUF|        35735|                HU|          50|              HU|           L|
|  8|     2020|              MI|             FT|Business Data Ana...|  135000|            USD|       135000|                US|         100|              US|           L|
|  9|     2020|              SE|             FT|  Lead Data Engineer|  125000|            USD|       125000|                NZ|          50|              NZ|           S|
| 10|     2020|              EN|             FT|      Data Scientist|   45000|            EUR|        51321|                FR|           0|              FR|           S|
| 11|     2020|              MI|             FT|      Data Scientist| 3000000|            INR|        40481|                IN|           0|              IN|           L|
| 12|     2020|              EN|             FT|      Data Scientist|   35000|            EUR|        39916|                FR|           0|              FR|           M|
| 13|     2020|              MI|             FT|   Lead Data Analyst|   87000|            USD|        87000|                US|         100|              US|           L|
| 14|     2020|              MI|             FT|        Data Analyst|   85000|            USD|        85000|                US|         100|              US|           L|
| 15|     2020|              MI|             FT|        Data Analyst|    8000|            USD|         8000|                PK|          50|              PK|           L|
| 16|     2020|              EN|             FT|       Data Engineer| 4450000|            JPY|        41689|                JP|         100|              JP|           S|
| 17|     2020|              SE|             FT|   Big Data Engineer|  100000|            EUR|       114047|                PL|         100|              GB|           S|
| 18|     2020|              EN|             FT|Data Science Cons...|  423000|            INR|         5707|                IN|          50|              IN|           M|
| 19|     2020|              MI|             FT|  Lead Data Engineer|   56000|            USD|        56000|                PT|         100|              US|           M|
+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
only showing top 20 rows

write schema of scv on screen

In [7]:
df.printSchema()

root
 |-- _c0: integer (nullable = true)
 |-- work_year: integer (nullable = true)
 |-- experience_level: string (nullable = true)
 |-- employment_type: string (nullable = true)
 |-- job_title: string (nullable = true)
 |-- salary: integer (nullable = true)
 |-- salary_currency: string (nullable = true)
 |-- salary_in_usd: integer (nullable = true)
 |-- employee_residence: string (nullable = true)
 |-- remote_ratio: integer (nullable = true)
 |-- company_location: string (nullable = true)
 |-- company_size: string (nullable = true)

create schema of this scv

In [8]:
schema = StructType([
    StructField("_c0", IntegerType(), nullable=True),
    StructField("work_year", IntegerType(), nullable=True),
    StructField("experience_level", StringType(), nullable=True),
    StructField("employment_type", StringType(), nullable=True),
    StructField("job_title", StringType(), nullable=True),
    StructField("salary", IntegerType(), nullable=True),
    StructField("salary_currency", StringType(), nullable=True),
    StructField("salary_in_usd", IntegerType(), nullable=True),
    StructField("employee_residence", StringType(), nullable=True),
    StructField("remote_ratio", IntegerType(), nullable=True),
    StructField("company_location", StringType(), nullable=True),
    StructField("company_size", StringType(), nullable=True)
])

restart kernel without cleaning output and after restarting you need to initialize SparkSession, after initialize start execute only cells from cell with schema=
=StructType.... 
To restart kernel click Kernel, Restart.

read ds_salaries with predefined schema and compare results from this cell and cell with inferSchema

In [9]:
df = spark.read.csv("ds_salaries.csv", header=True, schema=schema)

this happens because read operation is lazy(transformation), but if you use inferschema it start to be action that will create Spark Job, because Spark need to loop throw all file to check datatypes for all columns and this can harm to your code(if we compare to parquet, it will also go to check data types, but parquet provide meta information, so Spark will not go throw all file, he will just read meta information, but csv don't provide such meta information). Also header make Spark to create one more Spark Job to check first line
to define name of columns and remember to skeep it when reading. Actual reading start when you will use first action. More about Spark Jobs you will see in next topic

write schema of scv on screen one more time and compare with previous

In [10]:
df.printSchema()

root
 |-- _c0: integer (nullable = true)
 |-- work_year: integer (nullable = true)
 |-- experience_level: string (nullable = true)
 |-- employment_type: string (nullable = true)
 |-- job_title: string (nullable = true)
 |-- salary: integer (nullable = true)
 |-- salary_currency: string (nullable = true)
 |-- salary_in_usd: integer (nullable = true)
 |-- employee_residence: string (nullable = true)
 |-- remote_ratio: integer (nullable = true)
 |-- company_location: string (nullable = true)
 |-- company_size: string (nullable = true)

now continue to work with one of the dataframes that you create

print data in dataframe using df.show

In [11]:
df.show()

+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
|_c0|work_year|experience_level|employment_type|           job_title|  salary|salary_currency|salary_in_usd|employee_residence|remote_ratio|company_location|company_size|
+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
|  0|     2020|              MI|             FT|      Data Scientist|   70000|            EUR|        79833|                DE|           0|              DE|           L|
|  1|     2020|              SE|             FT|Machine Learning ...|  260000|            USD|       260000|                JP|           0|              JP|           S|
|  2|     2020|              SE|             FT|   Big Data Engineer|   85000|            GBP|       109024|                GB|          50|              GB|           M|
|  3|     2020|              MI|             FT|Product Data Analyst|   20000|            USD|        20000|                HN|           0|              HN|           S|
|  4|     2020|              SE|             FT|Machine Learning ...|  150000|            USD|       150000|                US|          50|              US|           L|
|  5|     2020|              EN|             FT|        Data Analyst|   72000|            USD|        72000|                US|         100|              US|           L|
|  6|     2020|              SE|             FT| Lead Data Scientist|  190000|            USD|       190000|                US|         100|              US|           S|
|  7|     2020|              MI|             FT|      Data Scientist|11000000|            HUF|        35735|                HU|          50|              HU|           L|
|  8|     2020|              MI|             FT|Business Data Ana...|  135000|            USD|       135000|                US|         100|              US|           L|
|  9|     2020|              SE|             FT|  Lead Data Engineer|  125000|            USD|       125000|                NZ|          50|              NZ|           S|
| 10|     2020|              EN|             FT|      Data Scientist|   45000|            EUR|        51321|                FR|           0|              FR|           S|
| 11|     2020|              MI|             FT|      Data Scientist| 3000000|            INR|        40481|                IN|           0|              IN|           L|
| 12|     2020|              EN|             FT|      Data Scientist|   35000|            EUR|        39916|                FR|           0|              FR|           M|
| 13|     2020|              MI|             FT|   Lead Data Analyst|   87000|            USD|        87000|                US|         100|              US|           L|
| 14|     2020|              MI|             FT|        Data Analyst|   85000|            USD|        85000|                US|         100|              US|           L|
| 15|     2020|              MI|             FT|        Data Analyst|    8000|            USD|         8000|                PK|          50|              PK|           L|
| 16|     2020|              EN|             FT|       Data Engineer| 4450000|            JPY|        41689|                JP|         100|              JP|           S|
| 17|     2020|              SE|             FT|   Big Data Engineer|  100000|            EUR|       114047|                PL|         100|              GB|           S|
| 18|     2020|              EN|             FT|Data Science Cons...|  423000|            INR|         5707|                IN|          50|              IN|           M|
| 19|     2020|              MI|             FT|  Lead Data Engineer|   56000|            USD|        56000|                PT|         100|              US|           M|
+---+---------+----------------+---------------+--------------------+--------+---------------+-------------+------------------+------------+----------------+------------+
only showing top 20 rows

print data in dataframe using display(df.toPandas())

In [12]:
df.toPandas()

,_c0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

create df_job_title that consists from all job_titles without duplicates

In [13]:
df_job_title = df.select(col("job_title")).distinct()

print all rows from df_job_titles without truncating jobs

In [14]:
df_job_title.show(2000, truncate=False)

+----------------------------------------+
|job_title                               |
+----------------------------------------+
|3D Computer Vision Researcher           |
|Lead Data Engineer                      |
|Head of Machine Learning                |
|Data Specialist                         |
|Data Analytics Lead                     |
|Machine Learning Scientist              |
|Lead Data Analyst                       |
|Data Engineering Manager                |
|Staff Data Scientist                    |
|ETL Developer                           |
|Director of Data Engineering            |
|Product Data Analyst                    |
|Principal Data Scientist                |
|AI Scientist                            |
|Director of Data Science                |
|Machine Learning Engineer               |
|Lead Data Scientist                     |
|Machine Learning Infrastructure Engineer|
|Data Science Engineer                   |
|Machine Learning Manager                |
|Research Scientist                      |
|Head of Data                            |
|Cloud Data Engineer                     |
|Machine Learning Developer              |
|Data Scientist                          |
|Finance Data Analyst                    |
|Data Analyst                            |
|Data Analytics Engineer                 |
|Data Science Consultant                 |
|Principal Data Engineer                 |
|Lead Machine Learning Engineer          |
|ML Engineer                             |
|Analytics Engineer                      |
|Data Science Manager                    |
|Business Data Analyst                   |
|Principal Data Analyst                  |
|Applied Machine Learning Scientist      |
|Financial Data Analyst                  |
|Data Analytics Manager                  |
|Computer Vision Engineer                |
|Computer Vision Software Engineer       |
|Big Data Engineer                       |
|Head of Data Science                    |
|NLP Engineer                            |
|Big Data Architect                      |
|Applied Data Scientist                  |
|Data Architect                          |
|BI Data Analyst                         |
|Marketing Data Analyst                  |
|Data Engineer                           |
+----------------------------------------+

create  df_analytic that will consists from max, avg, min USD salaries for all job_titles using groupBy. name of fields is avg_salary, min_salary, max_salary

In [15]:
df_analytic = df.groupBy("job_title").agg(
    avg("salary").alias("avg_salary"),
    min("salary").alias("min_salary"),
    max("salary").alias("max_salary")
)

print all rows from df_analytic without trancating jobs

In [16]:
df_analytic.show(100,truncate = False)

+----------------------------------------+------------------+----------+----------+
|job_title                               |avg_salary        |min_salary|max_salary|
+----------------------------------------+------------------+----------+----------+
|3D Computer Vision Researcher           |400000.0          |400000    |400000    |
|Lead Data Engineer                      |140333.33333333334|56000     |276000    |
|Head of Machine Learning                |6000000.0         |6000000   |6000000   |
|Data Specialist                         |165000.0          |165000    |165000    |
|Data Analytics Lead                     |405000.0          |405000    |405000    |
|Machine Learning Scientist              |158412.5          |12000     |260000    |
|Lead Data Analyst                       |569000.0          |87000     |1450000   |
|Data Engineering Manager                |119799.8          |51999     |174000    |
|Staff Data Scientist                    |105000.0          |105000    |105000    |
|ETL Developer                           |50000.0           |50000     |50000     |
|Director of Data Engineering            |141250.0          |82500     |200000    |
|Product Data Analyst                    |235000.0          |20000     |450000    |
|Principal Data Scientist                |206714.2857142857 |130000    |416000    |
|AI Scientist                            |290571.4285714286 |12000     |1335000   |
|Director of Data Science                |193285.7142857143 |110000    |325000    |
|Machine Learning Engineer               |272717.8780487805 |20000     |4900000   |
|Lead Data Scientist                     |1101666.6666666667|115000    |3000000   |
|Machine Learning Infrastructure Engineer|97333.33333333333 |44000     |195000    |
|Data Science Engineer                   |84500.0           |34000     |159500    |
|Machine Learning Manager                |157000.0          |157000    |157000    |
|Research Scientist                      |110493.6875       |42000     |450000    |
|Head of Data                            |156400.0          |30000     |235000    |
|Cloud Data Engineer                     |140000.0          |120000    |160000    |
|Machine Learning Developer              |100000.0          |100000    |100000    |
|Data Scientist                          |508347.2027972028 |4000      |30400000  |
|Finance Data Analyst                    |45000.0           |45000     |45000     |
|Data Analyst                            |96604.9587628866  |8000      |450000    |
|Data Analytics Engineer                 |61750.0           |20000     |110000    |
|Data Science Consultant                 |122714.28571428571|54000     |423000    |
|Principal Data Engineer                 |328333.3333333333 |185000    |600000    |
|Lead Machine Learning Engineer          |80000.0           |80000     |80000     |
|ML Engineer                             |2676666.6666666665|14000     |8500000   |
|Analytics Engineer                      |175000.0          |135000    |205300    |
|Data Science Manager                    |1062598.5833333333|137141    |7000000   |
|Business Data Analyst                   |355000.0          |50000     |1400000   |
|Principal Data Analyst                  |122500.0          |75000     |170000    |
|Applied Machine Learning Scientist      |141350.0          |29000     |423000    |
|Financial Data Analyst                  |275000.0          |100000    |450000    |
|Data Analytics Manager                  |127134.28571428571|105400    |150260    |
|Computer Vision Engineer                |83500.0           |10000     |180000    |
|Computer Vision Software Engineer       |100333.33333333333|70000     |150000    |
|Big Data Engineer                       |455000.0          |18000     |1672000   |
|Head of Data Science                    |146718.75         |85000     |224000    |
|NLP Engineer                            |240000.0          |240000    |240000    |
|Big Data Architect                      |125000.0          |125000    |125000    |
|Applied Data Scientist                  |172400.0          |68000     |380000    |
|Data Architect                          |177873.9090909091 |90700     |266400    |
|BI Data Analyst                         |1902045.3333333333|9272      |11000000  |
|Marketing Data Analyst                  |75000.0           |75000     |75000     |
|Data Engineer                           |179210.55303030304|4000      |4450000   |
+----------------------------------------+------------------+----------+----------+

now you need to add in df_analytic column row_id, that will show order of all job_titles depending on avg salary. they should be descending

In [17]:
window_spec = Window.orderBy(F.desc("avg_salary"))

In [18]:
df_analytic = df_analytic.withColumn("row_id", F.row_number().over(window_spec))

print all data from df_analytic

In [19]:
df_analytic.show(100, truncate = False)

+----------------------------------------+------------------+----------+----------+------+
|job_title                               |avg_salary        |min_salary|max_salary|row_id|
+----------------------------------------+------------------+----------+----------+------+
|Head of Machine Learning                |6000000.0         |6000000   |6000000   |1     |
|ML Engineer                             |2676666.6666666665|14000     |8500000   |2     |
|BI Data Analyst                         |1902045.3333333333|9272      |11000000  |3     |
|Lead Data Scientist                     |1101666.6666666667|115000    |3000000   |4     |
|Data Science Manager                    |1062598.5833333333|137141    |7000000   |5     |
|Lead Data Analyst                       |569000.0          |87000     |1450000   |6     |
|Data Scientist                          |508347.2027972028 |4000      |30400000  |7     |
|Big Data Engineer                       |455000.0          |18000     |1672000   |8     |
|Data Analytics Lead                     |405000.0          |405000    |405000    |9     |
|3D Computer Vision Researcher           |400000.0          |400000    |400000    |10    |
|Business Data Analyst                   |355000.0          |50000     |1400000   |11    |
|Principal Data Engineer                 |328333.3333333333 |185000    |600000    |12    |
|AI Scientist                            |290571.4285714286 |12000     |1335000   |13    |
|Financial Data Analyst                  |275000.0          |100000    |450000    |14    |
|Machine Learning Engineer               |272717.8780487805 |20000     |4900000   |15    |
|NLP Engineer                            |240000.0          |240000    |240000    |16    |
|Product Data Analyst                    |235000.0          |20000     |450000    |17    |
|Principal Data Scientist                |206714.2857142857 |130000    |416000    |18    |
|Director of Data Science                |193285.7142857143 |110000    |325000    |19    |
|Data Engineer                           |179210.55303030304|4000      |4450000   |20    |
|Data Architect                          |177873.9090909091 |90700     |266400    |21    |
|Analytics Engineer                      |175000.0          |135000    |205300    |22    |
|Applied Data Scientist                  |172400.0          |68000     |380000    |23    |
|Data Specialist                         |165000.0          |165000    |165000    |24    |
|Machine Learning Scientist              |158412.5          |12000     |260000    |25    |
|Machine Learning Manager                |157000.0          |157000    |157000    |26    |
|Head of Data                            |156400.0          |30000     |235000    |27    |
|Head of Data Science                    |146718.75         |85000     |224000    |28    |
|Applied Machine Learning Scientist      |141350.0          |29000     |423000    |29    |
|Director of Data Engineering            |141250.0          |82500     |200000    |30    |
|Lead Data Engineer                      |140333.33333333334|56000     |276000    |31    |
|Cloud Data Engineer                     |140000.0          |120000    |160000    |32    |
|Data Analytics Manager                  |127134.28571428571|105400    |150260    |33    |
|Big Data Architect                      |125000.0          |125000    |125000    |34    |
|Data Science Consultant                 |122714.28571428571|54000     |423000    |35    |
|Principal Data Analyst                  |122500.0          |75000     |170000    |36    |
|Data Engineering Manager                |119799.8          |51999     |174000    |37    |
|Research Scientist                      |110493.6875       |42000     |450000    |38    |
|Staff Data Scientist                    |105000.0          |105000    |105000    |39    |
|Computer Vision Software Engineer       |100333.33333333333|70000     |150000    |40    |
|Machine Learning Developer              |100000.0          |100000    |100000    |41    |
|Machine Learning Infrastructure Engineer|97333.33333333333 |44000     |195000    |42    |
|Data Analyst                            |96604.9587628866  |8000      |450000    |43    |
|Data Science Engineer                   |84500.0           |34000     |159500    |44    |
|Computer Vision Engineer                |83500.0           |10000     |180000    |45    |
|Lead Machine Learning Engineer          |80000.0           |80000     |80000     |46    |
|Marketing Data Analyst                  |75000.0           |75000     |75000     |47    |
|Data Analytics Engineer                 |61750.0           |20000     |110000    |48    |
|ETL Developer                           |50000.0           |50000     |50000     |49    |
|Finance Data Analyst                    |45000.0           |45000     |45000     |50    |
+----------------------------------------+------------------+----------+----------+------+

it isn't beautifull, so we need to put now row_id on first place in df_analytic

In [20]:
df_analytic = df_analytic.select(col("row_id"), *df_analytic.columns[:-1])

print df_analytic now

In [21]:
df_analytic.show(100, truncate = False)

+------+----------------------------------------+------------------+----------+----------+
|row_id|job_title                               |avg_salary        |min_salary|max_salary|
+------+----------------------------------------+------------------+----------+----------+
|1     |Head of Machine Learning                |6000000.0         |6000000   |6000000   |
|2     |ML Engineer                             |2676666.6666666665|14000     |8500000   |
|3     |BI Data Analyst                         |1902045.3333333333|9272      |11000000  |
|4     |Lead Data Scientist                     |1101666.6666666667|115000    |3000000   |
|5     |Data Science Manager                    |1062598.5833333333|137141    |7000000   |
|6     |Lead Data Analyst                       |569000.0          |87000     |1450000   |
|7     |Data Scientist                          |508347.2027972028 |4000      |30400000  |
|8     |Big Data Engineer                       |455000.0          |18000     |1672000   |
|9     |Data Analytics Lead                     |405000.0          |405000    |405000    |
|10    |3D Computer Vision Researcher           |400000.0          |400000    |400000    |
|11    |Business Data Analyst                   |355000.0          |50000     |1400000   |
|12    |Principal Data Engineer                 |328333.3333333333 |185000    |600000    |
|13    |AI Scientist                            |290571.4285714286 |12000     |1335000   |
|14    |Financial Data Analyst                  |275000.0          |100000    |450000    |
|15    |Machine Learning Engineer               |272717.8780487805 |20000     |4900000   |
|16    |NLP Engineer                            |240000.0          |240000    |240000    |
|17    |Product Data Analyst                    |235000.0          |20000     |450000    |
|18    |Principal Data Scientist                |206714.2857142857 |130000    |416000    |
|19    |Director of Data Science                |193285.7142857143 |110000    |325000    |
|20    |Data Engineer                           |179210.55303030304|4000      |4450000   |
|21    |Data Architect                          |177873.9090909091 |90700     |266400    |
|22    |Analytics Engineer                      |175000.0          |135000    |205300    |
|23    |Applied Data Scientist                  |172400.0          |68000     |380000    |
|24    |Data Specialist                         |165000.0          |165000    |165000    |
|25    |Machine Learning Scientist              |158412.5          |12000     |260000    |
|26    |Machine Learning Manager                |157000.0          |157000    |157000    |
|27    |Head of Data                            |156400.0          |30000     |235000    |
|28    |Head of Data Science                    |146718.75         |85000     |224000    |
|29    |Applied Machine Learning Scientist      |141350.0          |29000     |423000    |
|30    |Director of Data Engineering            |141250.0          |82500     |200000    |
|31    |Lead Data Engineer                      |140333.33333333334|56000     |276000    |
|32    |Cloud Data Engineer                     |140000.0          |120000    |160000    |
|33    |Data Analytics Manager                  |127134.28571428571|105400    |150260    |
|34    |Big Data Architect                      |125000.0          |125000    |125000    |
|35    |Data Science Consultant                 |122714.28571428571|54000     |423000    |
|36    |Principal Data Analyst                  |122500.0          |75000     |170000    |
|37    |Data Engineering Manager                |119799.8          |51999     |174000    |
|38    |Research Scientist                      |110493.6875       |42000     |450000    |
|39    |Staff Data Scientist                    |105000.0          |105000    |105000    |
|40    |Computer Vision Software Engineer       |100333.33333333333|70000     |150000    |
|41    |Machine Learning Developer              |100000.0          |100000    |100000    |
|42    |Machine Learning Infrastructure Engineer|97333.33333333333 |44000     |195000    |
|43    |Data Analyst                            |96604.9587628866  |8000      |450000    |
|44    |Data Science Engineer                   |84500.0           |34000     |159500    |
|45    |Computer Vision Engineer                |83500.0           |10000     |180000    |
|46    |Lead Machine Learning Engineer          |80000.0           |80000     |80000     |
|47    |Marketing Data Analyst                  |75000.0           |75000     |75000     |
|48    |Data Analytics Engineer                 |61750.0           |20000     |110000    |
|49    |ETL Developer                           |50000.0           |50000     |50000     |
|50    |Finance Data Analyst                    |45000.0           |45000     |45000     |
+------+----------------------------------------+------------------+----------+----------+

here you need to create df_exp_lvl with the biggest usd_salary(biggest_salary) for each experience_level(you need to save all fields like in entire dataframe)

In [22]:
window_spec = Window.partitionBy("experience_level").orderBy(col("salary_in_usd").desc())

print here df_exp_lvl

In [23]:
df_exp_lvl = df.withColumn("rn", row_number().over(window_spec)) \
                        .filter(col("rn") == 1) \
                        .drop("rn") \
                        .withColumnRenamed("salary_in_usd", "biggest_salary")

In [24]:
df_exp_lvl.toPandas()

,_c0,work_year,experience_level,employment_type,job_title,salary,salary_currency,biggest_salary,employee_residence,remote_ratio,company_location,company_size
0,37,2020,EN,FT,Machine Learning Engineer,250000,USD,250000,US,50,US,L
1,252,2021,EX,FT,Principal Data Engineer,600000,USD,600000,US,100,US,L
2,33,2020,MI,FT,Research Scientist,450000,USD,450000,US,0,US,M
3,63,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L

In [25]:
df.toPandas()

,_c0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

create df_best that consists from rows where salary of guy same as biggest salary for other people in his exp_lvl and choose only columns: id, experience_level, biggest_salary, employee_residence

print df_best

In [26]:
df_best = df.alias("df").join(df_exp_lvl.alias("df_exp"), col("df.salary_in_usd") == col("df_exp.biggest_salary"), "inner").select(col("df._c0"), col("df.experience_level"), col("df_exp.biggest_salary"), col("df.employee_residence"))

In [27]:
df_best.toPandas()

   _c0 experience_level  biggest_salary employee_residence
0   33               MI          450000                 US
1   37               EN          250000                 US
2   63               SE          412000                 US
3   97               MI          450000                 US
4  167               EX          250000                 US
5  252               EX          600000                 US

drop duplicates if exist by experience_level

In [28]:
df_best = df_best.dropDuplicates(["experience_level"])

print df_best

In [29]:
df_best.toPandas()

   _c0 experience_level  biggest_salary employee_residence
0   37               EN          250000                 US
1  167               EX          250000                 US
2   33               MI          450000                 US
3   63               SE          412000                 US

create df_new_best from df_best without id, and make the next: when exp_level = MI we want middle, when SE we want senior, else Null

In [30]:
df_new_best = df_best.drop("_c0").withColumn("level_description", when(col("experience_level") == "MI", "middle").
when(col("experience_level") == "SE", "senior").otherwise(None))

print df_new_best

In [31]:
df_new_best.toPandas()

  experience_level  biggest_salary employee_residence level_description
0               EN          250000                 US              None
1               EX          250000                 US              None
2               MI          450000                 US            middle
3               SE          412000                 US            senior

write df_new_best like 1.csv and load then it to df_final

In [33]:
df_new_best.write.csv("1.csv", header=True)

print df_final

In [34]:
df_final = spark.read.csv("1.csv", header=True, inferSchema=True)

In [35]:
df_final.show()

+----------------+--------------+------------------+-----------------+
|experience_level|biggest_salary|employee_residence|level_description|
+----------------+--------------+------------------+-----------------+
|              EN|        250000|                US|             null|
|              EX|        250000|                US|             null|
|              MI|        450000|                US|           middle|
|              SE|        412000|                US|           senior|
+----------------+--------------+------------------+-----------------+

filter df_final to delete experience_level where it Null, then join this table by biggest_salary(salary_in_usd) and employee_residence with entire df

In [37]:
df_final = df_final.filter(col("experience_level").isNotNull())

In [43]:
df_final = df.join(df_final, (df["salary_in_usd"] == df_final["biggest_salary"]) & (df["employee_residence"] == df_final["employee_residence"]), "inner")

print df_final

In [44]:
df_final.show()

+---+---------+----------------+---------------+--------------------+------+---------------+-------------+------------------+------------+----------------+------------+----------------+--------------+------------------+-----------------+
|_c0|work_year|experience_level|employment_type|           job_title|salary|salary_currency|salary_in_usd|employee_residence|remote_ratio|company_location|company_size|experience_level|biggest_salary|employee_residence|level_description|
+---+---------+----------------+---------------+--------------------+------+---------------+-------------+------------------+------------+----------------+------------+----------------+--------------+------------------+-----------------+
| 33|     2020|              MI|             FT|  Research Scientist|450000|            USD|       450000|                US|           0|              US|           M|              MI|        450000|                US|           middle|
| 37|     2020|              EN|             FT|Machine Learning ...|250000|            USD|       250000|                US|          50|              US|           L|              EX|        250000|                US|             null|
| 37|     2020|              EN|             FT|Machine Learning ...|250000|            USD|       250000|                US|          50|              US|           L|              EN|        250000|                US|             null|
| 63|     2020|              SE|             FT|      Data Scientist|412000|            USD|       412000|                US|         100|              US|           L|              SE|        412000|                US|           senior|
| 97|     2021|              MI|             FT|Financial Data An...|450000|            USD|       450000|                US|         100|              US|           L|              MI|        450000|                US|           middle|
|167|     2021|              EX|             FT|Director of Data ...|250000|            USD|       250000|                US|           0|              US|           L|              EX|        250000|                US|             null|
|167|     2021|              EX|             FT|Director of Data ...|250000|            USD|       250000|                US|           0|              US|           L|              EN|        250000|                US|             null|
+---+---------+----------------+---------------+--------------------+------+---------------+-------------+------------------+------------+----------------+------------+----------------+--------------+------------------+-----------------+

In [45]:
df_final.toPandas()

,_c0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,experience_level,biggest_salary,employee_residence,level_description
0,33,2020,MI,FT,Research Scientist,450000,USD,450000,US,0,US,M,MI,450000,US,middle
1,37,2020,EN,FT,Machine Learning Engineer,250000,USD,250000,US,50,US,L,EX,250000,US,None
2,37,2020,EN,FT,Machine Learning Engineer,250000,USD,250000,US,50,US,L,EN,250000,US,None
3,63,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L,SE,412000,US,senior
4,97,2021,MI,FT,Financial Data Analyst,450000,USD,450000,US,100,US,L,MI,450000,US,middle
5,167,2021,EX,FT,Director of Data Science,250000,USD,250000,US,0,US,L,EX,250000,US,None
6,167,2021,EX,FT,Director of Data Science,250000,USD,250000,US,0,US,L,EN,250000,US,None

last task is to save in variable and then print this variable of the biggest salary_in_usd from df_final

In [48]:
max_salary = df_final.select(max("salary_in_usd")).first()[0]
# The first() function is used to retrieve the maximum value as a Row object, 
# and [0] is used to extract the value from the Row. Finally, we print the maximum salary.

In [49]:
print("Max_salary from final table is: ", max_salary)

Max_salary from final table is:  450000

It is the end of PySpark basics. In other lessons you will learn optimizations technics and how to make distributed system